Repository: roadiz/AbstractApiTheme
Catalog: src/Resources/translations/messages.*.xlf
Languages: fr

# api.applications._name_.was_created
source: API application «%name%» was created.
fr: L’application API «%name%» a bien été créée.

# api.applications._name_.was_updated
source: API application «%name%» was updated.
fr: L’application API «%name%» a bien été mise à jour.

# api.applications.add
source: Create an application
fr: Créer une application

# api.applications.allowedPreview
source: Allow preview mode
fr: Autoriser la prévisualisation

# api.applications.allowedPreview.help
source: **Be careful**, this application will be able to access all non-published node. Do not use in public mode.
fr: **Attention**, cette application verra tous les nœuds non-publiés. Ne pas utiliser en mode public.

# api.applications.api_key_in_use
source: Api key is already is use.
fr: La clé d’API est déjà utilisée.

# api.applications.apiKey
source: API key
fr: Clé d’API

# api.applications.are_you_sure_delete
source: Are you sure to delete current application? This will permanently destroy its API key and remove access to any application that was using it in production. You can disable an application if you just want to remove access temporarily.
fr: Êtes-vous sûr·e de vouloir supprimer cette application ? Cela détruira de manière permanente la clé d’API et supprimera tous les accès des applications en cours d’utilisation. Vous pouvez simplement désactiver une application si vous ne souhaitez suspendre l’accès que temporairement.

# api.applications.delete
source: Delete application
fr: Supprimer l’application

# api.applications.edit
source: Edit
fr: Éditer

# api.applications.enabled
source: Enabled?
fr: Disponible ?

# api.applications.form.add
source: Create application
fr: Créer l’application

# api.applications.form.apply
source: Save application details
fr: Appliquer les changements

# api.applications.form.delete
source: Delete
fr: Supprimer

# api.applications.name
source: Application name
fr: Nom de l’application

# api.applications.referer
source: Authorized referrer (regular expression)
fr: Referrer autorisé (expression régulière)

# api.applications.updated_at
source: Updated at
fr: Mise à jour le

# api.no_application
source: No application available
fr: Aucune application disponible

# back_to.applications
source: Back to applications list
fr: Retour à la liste des applications
